
t = dict((x, y) for x in [1, 2] for y in [3, 4])
print(t)

l = ['Сергей Карандаш 3',
     'Андрей Тетрадь 5',
     'Юлия Линейка 1',
     'Сергей Ручка 2',
     'Юлия Книга 4',
     'Юлия Книга 4',
     ]

print(l)
d = {}
for i in l:
    x, y, z = i.split()
    # d[x][y] = d.setdefault(x, {}).setdefault(y, 0) + int(z)

    # d.setdefault(x, {})
    # d[x] = d.get(x, {})
    if not d.get(x):
        d[x] = {}

    d[x][y] = d[x].get(y, 0) + int(z)

    print(x, y, z)
print(d)

d = {1: 2, 2: 3}
if d.setdefault(5):
    d[5] = 99
    print('--', d)
print('---', d)


d1 = {1: 2, 2: 3}
d2 = {1: 4, 2: 5}

m = {i: d1.get(i, 0) + d2.get(i, 0) for i in d1.keys() | d2.keys()}

print(m)


cats = [('Мартин', 5, 'Алексей', 'Егоров'),
        ('Фродо', 3, 'Анна', 'Самохина'),
        ('Вася', 4, 'Андрей', 'Белов'),
        ('Муся', 7, 'Игорь', 'Бероев'),
        ('Изольда', 2, 'Игорь', 'Бероев'),
        ('Снейп', 1, 'Марина', 'Апраксина'),
        ('Лютик', 4, 'Виталий', 'Соломин'),
        ('Снежок', 3, 'Марина', 'Апраксина'),
        ('Марта', 5, 'Сергей', 'Колесников'),
        ('Буся', 12, 'Алена', 'Федорова'),
        ('Джонни', 10, 'Игорь', 'Андропов'),
        ('Мурзик', 1, 'Даниил', 'Невзоров'),
        ('Барсик', 2, 'Виталий', 'Соломин'),
        ('Рыжик', 7, 'Владимир', 'Медведев'),
        ('Матильда', 8, 'Андрей', 'Белов'),
        ('Гарфилд', 3, 'Александр', 'Березуев')]

# d = {i[-2:]: i[:2] for i in cats}
d = {}
for i in cats:
    nc, n, i, f = i
    fi = f'{i} {f}'
    d[fi] = d.get(fi, ': ') + f'{nc}, {n};'
    print(fi, d[fi][:-1])


def choose_plural(amount: int, declensions: tuple):

    if amount == 0:
        i = 0
    elif amount == 1:
        i = 1

    return declensions[i]


print(choose_plural(21, ('пример', 'примера', 'примеров')))
