from collections import ChainMap
import json
from functools import reduce
from collections import Counter

for_adoption = {'dogs': 15, 'cats': 8, 'pythons': 9}
vet_treatment = {'dogs': 7, 'cats': 2, 'tigers': 3}

pets = ChainMap(for_adoption, vet_treatment)
print(pets)
del pets['dogs']
print(*pets.keys())
# for key in pets.keys():
#     print(key, '->', pets[key])

# print()

# for value in pets.values():
#     print(value)

# print()

# for key, value in pets.items():
#     print(key, '->', value)


with open('zoo.json', encoding='utf-8') as file:
    data = json.load(file)

animals = ChainMap(*data)

print(reduce(lambda x, y: x+y, animals.values()))
print(sum(animals.values()))

print()


bread = {'булочка с кунжутом': 15, 'обычная булочка': 10, 'ржаная булочка': 15}
meat = {'куриный бифштекс': 50, 'говяжий бифштекс': 70, 'рыбный бифштекс': 40}
sauce = {'сливочно-чесночный': 15, 'кетчуп': 10,
         'горчица': 10, 'барбекю': 15, 'чили': 15}
vegetables = {'лук': 10, 'салат': 15, 'помидор': 15, 'огурцы': 10}
toppings = {'сыр': 25, 'яйцо': 15, 'бекон': 30}

pr = ChainMap(bread, meat, sauce, vegetables, toppings)

d = Counter({'ржаная булочка': 2, 'сыр': 2, 'говяжий бифштекс': 1,
            'салат': 1, 'барбекю': 1, 'помидор': 1})
# d = Counter(
#     '''булочка с кунжутом,обычная булочка,ржаная булочка,куриный бифштекс,говяжий бифштекс,рыбный бифштекс,сливочно-чесночный,кетчуп,горчица,барбекю,чили,лук,салат,помидор,огурцы,сыр,яйцо,бекон,булочка с кунжутом,обычная булочка,ржаная булочка,куриный бифштекс,говяжий бифштекс,рыбный бифштекс,сливочно-чесночный,кетчуп,горчица,барбекю,чили,лук,салат,помидор,огурцы,сыр,яйцо,бекон,булочка с кунжутом,обычная булочка,ржаная булочка,куриный бифштекс,говяжий бифштекс,рыбный бифштекс,сливочно-чесночный,кетчуп,горчица,барбекю,чили,лук,салат,помидор,огурцы,сыр,яйцо,бекон,булочка с кунжутом,обычная булочка,ржаная булочка,куриный бифштекс,говяжий бифштекс,рыбный бифштекс,сливочно-чесночный,кетчуп,горчица,барбекю,чили,лук,салат,помидор,огурцы,сыр,яйцо,бекон,булочка с кунжутом,обычная булочка,ржаная булочка,куриный бифштекс,говяжий бифштекс,рыбный бифштекс,сливочно-чесночный,кетчуп,горчица,барбекю,чили,лук,салат,помидор,огурцы,сыр,яйцо,бекон,булочка с кунжутом,обычная булочка,ржаная булочка,куриный бифштекс,говяжий бифштекс,рыбный бифштекс,сливочно-чесночный,кетчуп,горчица,барбекю,чили,лук,салат,помидор,огурцы,сыр,яйцо,бекон,булочка с кунжутом,обычная булочка,ржаная булочка,куриный бифштекс,говяжий бифштекс,рыбный бифштекс,сливочно-чесночный,кетчуп,горчица,барбекю,чили,лук,салат,помидор,огурцы,сыр,яйцо,бекон,булочка с кунжутом,обычная булочка,ржаная булочка,куриный бифштекс,говяжий бифштекс,рыбный бифштекс,сливочно-чесночный,кетчуп,горчица,барбекю,чили,лук,салат,помидор,огурцы,сыр,яйцо,бекон,булочка с кунжутом,обычная булочка,ржаная булочка,куриный бифштекс,говяжий бифштекс,рыбный бифштекс,сливочно-чесночный,кетчуп,горчица,барбекю,чили,лук,салат,помидор,огурцы,сыр,яйцо,бекон,булочка с кунжутом,обычная булочка,ржаная булочка,куриный бифштекс,говяжий бифштекс,рыбный бифштекс,сливочно-чесночный,кетчуп,горчица,барбекю,чили,лук,салат,помидор,огурцы,сыр,яйцо,бекон'''
#     .split(','))

print(d, pr)

m1 = max(d, key=lambda x: len(x))
m2 = len(m1)
print('--', m2)
s = 0
for i in sorted(d):
    print(f'{i.ljust(m2)} x {d[i]}')
    s += d[i]*pr[i]

ms = f'ИТОГ: {s}р'
print('-'*(m2+len(str(d[m1]))+3 if m2 > len(ms) else len(ms)))
print(ms)

print(m2, len(str(pr[m1]))+3)


s = [{1: 2, 2: 3}, {3: 4, 4: 5}]
# s = [{3: 4, 4: 5}]
# s = ['67', '89']


def iter111(s):
    d = {}
    print(*reversed(s))
    print('--', *map(dict.fromkeys, reversed(s)))
    for mapping in map(dict.fromkeys, reversed(s)):
        print('=', mapping)
        d |= mapping  # reuses stored hash values if possible return iter(d)d
    return d


print(iter111(s))

print(pr)
print(pr.maps[0]['булочка с кунжутом'])
